x86_nvme/singlethread/iscsi_libaio_1024_randread_16k.log
iscsi_libaio_1024_randread_16k: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=1024
fio-3.1
Starting 1 process

iscsi_libaio_1024_randread_16k: (groupid=0, jobs=1): err= 0: pid=29375: Mon Sep  7 23:13:32 2020
   read: IOPS=133k, BW=2082MiB/s (2183MB/s)(512GiB/251784msec)
    slat (nsec): min=1919, max=558637, avg=6210.39, stdev=14413.71
    clat (usec): min=275, max=21661, avg=7676.81, stdev=1130.70
     lat (usec): min=282, max=21727, avg=7683.10, stdev=1130.91
    clat percentiles (usec):
     |  1.00th=[ 5932],  5.00th=[ 6128], 10.00th=[ 6259], 20.00th=[ 6521],
     | 30.00th=[ 6783], 40.00th=[ 7111], 50.00th=[ 7701], 60.00th=[ 8094],
     | 70.00th=[ 8455], 80.00th=[ 8717], 90.00th=[ 9110], 95.00th=[ 9503],
     | 99.00th=[10159], 99.50th=[10421], 99.90th=[11207], 99.95th=[11863],
     | 99.99th=[16909]
   bw (  MiB/s): min= 1804, max= 2283, per=100.00%, avg=2082.79, stdev=110.87, samples=503
   iops        : min=115488, max=146122, avg=133298.57, stdev=7095.90, samples=503
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=98.63%, 20=1.36%, 50=0.01%
  cpu          : usr=21.02%, sys=37.84%, ctx=1771560, majf=0, minf=14674
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=33554432,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1024

Run status group 0 (all jobs):
   READ: bw=2082MiB/s (2183MB/s), 2082MiB/s-2082MiB/s (2183MB/s-2183MB/s), io=512GiB (550GB), run=251784-251784msec

Disk stats (read/write):
  nvme0n1: ios=33533558/0, merge=0/0, ticks=256125964/0, in_queue=255882720, util=100.00%