x86_nvme/singlethread/iscsi_libaio_1024_randread_8k.log
iscsi_libaio_1024_randread_8k: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1024
fio-3.1
Starting 1 process

iscsi_libaio_1024_randread_8k: (groupid=0, jobs=1): err= 0: pid=29340: Mon Sep  7 23:09:20 2020
   read: IOPS=233k, BW=1824MiB/s (1912MB/s)(512GiB/287457msec)
    slat (nsec): min=1762, max=135772, avg=2694.16, stdev=1555.39
    clat (usec): min=3334, max=11827, avg=4382.70, stdev=333.59
     lat (usec): min=3336, max=11829, avg=4385.51, stdev=333.67
    clat percentiles (usec):
     |  1.00th=[ 3752],  5.00th=[ 3949], 10.00th=[ 4146], 20.00th=[ 4228],
     | 30.00th=[ 4228], 40.00th=[ 4293], 50.00th=[ 4293], 60.00th=[ 4359],
     | 70.00th=[ 4424], 80.00th=[ 4555], 90.00th=[ 4817], 95.00th=[ 5080],
     | 99.00th=[ 5604], 99.50th=[ 5800], 99.90th=[ 6390], 99.95th=[ 6652],
     | 99.99th=[ 7242]
   bw (  MiB/s): min= 1504, max= 1877, per=100.00%, avg=1824.48, stdev=60.15, samples=574
   iops        : min=192560, max=240276, avg=233533.05, stdev=7699.60, samples=574
  lat (msec)   : 4=5.60%, 10=94.40%, 20=0.01%
  cpu          : usr=43.38%, sys=55.99%, ctx=50988, majf=0, minf=2072
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=67108864,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1024

Run status group 0 (all jobs):
   READ: bw=1824MiB/s (1912MB/s), 1824MiB/s-1824MiB/s (1912MB/s-1912MB/s), io=512GiB (550GB), run=287457-287457msec

Disk stats (read/write):
  nvme0n1: ios=67084461/0, merge=0/0, ticks=49877584/0, in_queue=49602612, util=100.00%