x86_nvme/singlethread/iscsi_libaio_1024_randwrite_16k.log
iscsi_libaio_1024_randwrite_16k: (g=0): rw=randwrite, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=1024
fio-3.1
Starting 1 process

iscsi_libaio_1024_randwrite_16k: (groupid=0, jobs=1): err= 0: pid=28813: Mon Sep  7 22:38:38 2020
  write: IOPS=89.5k, BW=1398MiB/s (1466MB/s)(512GiB/374899msec)
    slat (nsec): min=1895, max=8218.3k, avg=9791.72, stdev=59395.15
    clat (usec): min=16, max=35596, avg=11430.52, stdev=2223.91
     lat (usec): min=21, max=35601, avg=11440.40, stdev=2224.61
    clat percentiles (usec):
     |  1.00th=[ 7832],  5.00th=[ 8455], 10.00th=[ 8848], 20.00th=[ 9372],
     | 30.00th=[ 9896], 40.00th=[10421], 50.00th=[11207], 60.00th=[11863],
     | 70.00th=[12649], 80.00th=[13304], 90.00th=[14353], 95.00th=[15139],
     | 99.00th=[17433], 99.50th=[18744], 99.90th=[21103], 99.95th=[21890],
     | 99.99th=[23725]
   bw (  MiB/s): min= 1174, max= 1567, per=100.00%, avg=1398.88, stdev=75.76, samples=749
   iops        : min=75156, max=100342, avg=89528.45, stdev=4848.56, samples=749
  lat (usec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.05%, 10=32.76%, 20=66.94%, 50=0.23%
  cpu          : usr=19.55%, sys=26.52%, ctx=1094838, majf=0, minf=10580
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,33554432,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1024

Run status group 0 (all jobs):
  WRITE: bw=1398MiB/s (1466MB/s), 1398MiB/s-1398MiB/s (1466MB/s-1466MB/s), io=512GiB (550GB), run=374899-374899msec

Disk stats (read/write):
  nvme0n1: ios=45/33547029, merge=0/0, ticks=0/381650140, in_queue=381321112, util=100.00%