x86_nvme/singlethread/iscsi_libaio_1024_randwrite_512k.log
iscsi_libaio_1024_randwrite_512k: (g=0): rw=randwrite, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=1024
fio-3.1
Starting 1 process

iscsi_libaio_1024_randwrite_512k: (groupid=0, jobs=1): err= 0: pid=28894: Mon Sep  7 22:50:00 2020
  write: IOPS=3083, BW=1542MiB/s (1617MB/s)(512GiB/340033msec)
    slat (usec): min=17, max=5911, avg=321.77, stdev=386.41
    clat (msec): min=89, max=423, avg=331.65, stdev=10.45
     lat (msec): min=89, max=424, avg=331.98, stdev=10.46
    clat percentiles (msec):
     |  1.00th=[  309],  5.00th=[  317], 10.00th=[  321], 20.00th=[  326],
     | 30.00th=[  330], 40.00th=[  330], 50.00th=[  330], 60.00th=[  334],
     | 70.00th=[  334], 80.00th=[  338], 90.00th=[  342], 95.00th=[  347],
     | 99.00th=[  359], 99.50th=[  368], 99.90th=[  393], 99.95th=[  401],
     | 99.99th=[  414]
   bw (  MiB/s): min=  815, max= 1626, per=100.00%, avg=1542.61, stdev=39.05, samples=680
   iops        : min= 1630, max= 3252, avg=3085.14, stdev=78.09, samples=680
  lat (msec)   : 100=0.01%, 250=0.06%, 500=99.94%
  cpu          : usr=12.47%, sys=7.58%, ctx=413266, majf=0, minf=23
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,1048576,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1024

Run status group 0 (all jobs):
  WRITE: bw=1542MiB/s (1617MB/s), 1542MiB/s-1542MiB/s (1617MB/s-1617MB/s), io=512GiB (550GB), run=340033-340033msec

Disk stats (read/write):
  nvme0n1: ios=45/4193401, merge=0/0, ticks=0/347581044, in_queue=347321812, util=99.94%