x86_nvme/singlethread/iscsi_libaio_1024_randwrite_8k.log
iscsi_libaio_1024_randwrite_8k: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1024
fio-3.1
Starting 1 process

iscsi_libaio_1024_randwrite_8k: (groupid=0, jobs=1): err= 0: pid=28761: Mon Sep  7 22:32:22 2020
  write: IOPS=162k, BW=1268MiB/s (1330MB/s)(512GiB/413370msec)
    slat (nsec): min=1639, max=9260.9k, avg=4613.93, stdev=37953.41
    clat (usec): min=131, max=22764, avg=6302.04, stdev=1420.42
     lat (usec): min=151, max=22766, avg=6306.76, stdev=1420.68
    clat percentiles (usec):
     |  1.00th=[ 3720],  5.00th=[ 4113], 10.00th=[ 4555], 20.00th=[ 5014],
     | 30.00th=[ 5473], 40.00th=[ 5932], 50.00th=[ 6259], 60.00th=[ 6587],
     | 70.00th=[ 7046], 80.00th=[ 7504], 90.00th=[ 7963], 95.00th=[ 8455],
     | 99.00th=[10028], 99.50th=[11600], 99.90th=[14877], 99.95th=[15664],
     | 99.99th=[16712]
   bw (  MiB/s): min=  925, max= 1564, per=100.00%, avg=1268.63, stdev=106.18, samples=826
   iops        : min=118412, max=200260, avg=162384.23, stdev=13591.04, samples=826
  lat (usec)   : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=3.80%, 10=95.21%, 20=0.99%, 50=0.01%
  cpu          : usr=34.71%, sys=35.07%, ctx=477933, majf=0, minf=8561
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,67108864,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1024

Run status group 0 (all jobs):
  WRITE: bw=1268MiB/s (1330MB/s), 1268MiB/s-1268MiB/s (1330MB/s-1330MB/s), io=512GiB (550GB), run=413370-413370msec

Disk stats (read/write):
  nvme0n1: ios=45/67105321, merge=0/0, ticks=4/407207116, in_queue=406892140, util=100.00%